app/views/donations/_form.html.erb

SELECT "organizations".* FROM "organizations"
SELECT "products".* FROM "products"
---
  <div class="form-inputs">
    <%= f.collection_select(:organization_id, Organization.all, :id, :name, :prompt => "Select Donor") %>
    <br>
    <%= f.collection_select(:product_id, Product.all, :id, :name, :prompt => "Select Cause") %>