app/views/donations/index.html.erb

SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = 1 LIMIT 1
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
---
    <td><%= donation.created_at %></td>
    <td><%= Organization.find(donation.organization_id).name %></td>
    <td><%= Product.find(donation.product_id).name %></td>