app/views/donations/show.html.erb

SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT 1  [["id", 1]]
---
  <b>Donor:</b>
  <%= Organization.find(@donation.organization_id).name %>

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
---
  <b>Cause:</b>
  <%= Product.find(@donation.product_id).name %>