app/controllers/products_controller.rb

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("created_at", "name", "price", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 14 Nov 2012 02:52:48 UTC +00:00], ["name", "Knife"], ["price", #<BigDecimal:7f89282d7658,'0.1E1',9(18)>], ["updated_at", Wed, 14 Nov 2012 02:52:48 UTC +00:00]]

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "products" SET "name" = 'Whatever', "price" = 10.0, "updated_at" = '2012-11-14 21:50:58.993579' WHERE "products"."id" = 9