app/views/organizations/show.html.erb


<% if @organization.donations.any? %>
---
SELECT "donations".* FROM "donations" WHERE "donations"."organization_id" = 1
SELECT COUNT(*) FROM "donations" WHERE "donations"."organization_id" = 1