app/views/products/show.html.erb

SELECT "donations".* FROM "donations" WHERE "donations"."product_id" = 1
SELECT COUNT(*) FROM "donations" WHERE "donations"."product_id" = 1
---
<p>
  <% if @product.donations.any? %>